# Basis Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform..::..Basis Property
Transform Class See Also
---
Defines the basis of the old coordinate system in the new coordinate system.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ this[
	int idx
] { get; set; }
```

Visual Basic
---
```text
Public Property Basis ( _
	idx As Integer _
) As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ Basis[int idx] {
	XYZ^ get (int idx);
	void set (int idx, XYZ^ value);
}
```

# ### Parameters
idx
    Type: System..::..Int32The index of the basis vector: 0, 1 or 2.
# Remarks
This corresponds to the first three column vectors of the conventional 3x4 matrix representation.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | Thrown when the given index is larger than 2 in the getter and setter. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the transform is internally marked as read-only. |

# See Also
Transform Class
Autodesk.Revit.DB Namespace